//给定一个 8 x 8 的棋盘，只有一个 白色的车，用字符 'R' 表示。棋盘上还可能存在白色的象 'B' 以及黑色的卒 'p'。空方块用字符 '.' 表示。
// 
//
// 车可以按水平或竖直方向（上，下，左，右）移动任意个方格直到它遇到另一个棋子或棋盘的边界。如果它能够在一次移动中移动到棋子的方格，则能够 吃掉 棋子。 
//
// 注意：车不能穿过其它棋子，比如象和卒。这意味着如果有其它棋子挡住了路径，车就不能够吃掉棋子。 
//
// 返回白车将能 吃掉 的 卒的数量。 
//
// 
//
// 示例 1： 
//
// 
//
// 
//输入：[[".",".",".",".",".",".",".","."],[".",".",".","p",".",".",".","."],[".",
//".",".","R",".",".",".","p"],[".",".",".",".",".",".",".","."],[".",".",".",".",
//".",".",".","."],[".",".",".","p",".",".",".","."],[".",".",".",".",".",".",".",
//"."],[".",".",".",".",".",".",".","."]]
//输出：3
//解释：
//在本例中，车能够吃掉所有的卒。
// 
//
// 示例 2： 
//
// 
//
// 
//输入：[[".",".",".",".",".",".",".","."],[".","p","p","p","p","p",".","."],[".",
//"p","p","B","p","p",".","."],[".","p","B","R","B","p",".","."],[".","p","p","B",
//"p","p",".","."],[".","p","p","p","p","p",".","."],[".",".",".",".",".",".",".",
//"."],[".",".",".",".",".",".",".","."]]
//输出：0
//解释：
//象阻止了车吃掉任何卒。
// 
//
// 示例 3： 
//
// 
//
// 
//输入：[[".",".",".",".",".",".",".","."],[".",".",".","p",".",".",".","."],[".",
//".",".","p",".",".",".","."],["p","p",".","R",".","p","B","."],[".",".",".",".",
//".",".",".","."],[".",".",".","B",".",".",".","."],[".",".",".","p",".",".",".",
//"."],[".",".",".",".",".",".",".","."]]
//输出：3
//解释： 
//车可以吃掉位置 b5，d6 和 f5 的卒。
// 
//
// 
//
// 提示： 
//
// 
// board.length == 8 
// board[i].length == 8 
// board[i][j] 可以是 'R'，'.'，'B' 或 'p' 
// 只有一个格子上存在 board[i][j] == 'R' 
// 
//
// Related Topics数组 | 矩阵 | 模拟 
//
// 👍 116, 👎 0bug 反馈 | 使用指南 | 更多配套插件 
//
//
//
//


package leetcode.editor.cn;

/**
 * 可以被一步捕获的棋子数
 * @author ambrose
 * @date 2024-10-10 21:57:37
 */

public class P0999_AvailableCapturesForRook{
	 public static void main(String[] args) {
	 	 //测试代码
	 	 Solution solution = new P0999_AvailableCapturesForRook().new Solution();
	 }
	 
//力扣代码
//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
//		 只能沿一个方向前进
    public int numRookCaptures(char[][] board) {
		int x = 0, y = 0;
		for (int i = 0; i < 8; i++) {
			for (int j = 0; j < 8; j++) {
				if(board[i][j] == 'R'){
					x = j; y = i;break;
				}
			}
		}
		int cnt = 0;
		int[] dx = new int[]{1, 0, -1, 0};
		int[] dy = new int[]{0, 1, 0, -1};
		for (int i = 0; i <= 3; i++) {
			for (int step = 1;; step++) {
				int mx = x + dx[i] * step;
				int my = y + dy[i] * step;
				if(mx < 0 || mx >= 8 || my < 0 || my >= 8 || board[my][mx] == 'B')
					break;
				else if(board[my][mx] == 'p'){
					cnt++;
					break;
				}
			}
		}
		return cnt;
    }
}
//leetcode submit region end(Prohibit modification and deletion)

}